app/controllers/groups_controller.rb

  def index
    flash.now[:notice] = "#{params[:notice]}"
    @group = Group.new
    @groups = current_user.groups
---
SELECT `groups`.* FROM `groups` INNER JOIN `usergroups` ON `groups`.`id` = `usergroups`.`group_id` WHERE `usergroups`.`user_id` = 1

  def new
    @group = Group.new
      if params[:notice]
        @group.errors.add(:name, "エラーです")
      end
    @user = User.all
---
SELECT `users`.* FROM `users`

  def create

    group = Group.new
    count = false
    if  group.save(:name => params_permit_group[:name])
      count = true
      params_permit_group[:user_ids].each do |id|
        Usergroup.create(:user_id => id,:group_id => group.id)
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('aaaaaa', '2017-12-20 22:34:15', '2017-12-20 22:34:15')
INSERT INTO `usergroups` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (1, 3, '2017-12-24 06:11:54', '2017-12-24 06:11:54')

  def edit
    @group = Group.find(params[:id])
          if params[:notice]
        @group.errors.add(:name, "エラーです")
      end
    @user = User.all
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = NULL LIMIT 1
SELECT `users`.* FROM `users`

  def update
    count = 0
    group = Group.find(params[:id])
    if  group.update(:name => params_permit_group[:name])
      count = 1

      usergroups = group.usergroups
      usergroups.each do |usergroup|
        usergroup.delete
      end
      params_permit_group[:user_ids].each do |id|
        Usergroup.create(:user_id => id,:group_id => group.id)
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'a', `updated_at` = '2017-12-25 06:12:02' WHERE `groups`.`id` = 1
SELECT `groups`.* FROM `groups`
SELECT `usergroups`.* FROM `usergroups` WHERE `usergroups`.`group_id` = 51
DELETE FROM `usergroups` WHERE `usergroups`.`id` = 15
INSERT INTO `usergroups` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (1, 51, '2017-12-25 06:56:07', '2017-12-25 06:56:07')