app/controllers/users_controller.rb

  def edit
    @user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    user = User.find(current_user.id)
    user.update(params_permit)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `name` = 'aab', `updated_at` = '2017-12-18 09:56:34' WHERE `users`.`id` = 1